/******************************************************************************
  文 件 名   : cache.h
  版 本 号   : v 0.0.1
  作    者   : BarretXia
  生成日期   : 2015年8月28日
  最近修改   :
  功能描述   : 纯cache对象
  函数列表   :
  修改历史   :
  1.日    期   : 2015年8月28日
    作    者   : BarretXia
    修改内容   : 创建文件
******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#pragma once

#include <sys/time.h>
#include "mempool.h"
#include "socket.h"

//纯cache对象
class CRawCache
{
public:
    CRawCache(CMemPool& mp);
    ~CRawCache();

    char* data();
    unsigned int data_len();
    void append(const char* data, unsigned int data_len);
    void skip(unsigned int length);

private:
    //内存池对象
    CMemPool& _mp;
    //内存基址
    char* _mem;
    //内存大小
    unsigned int _block_size;
    //实际使用内存起始偏移量
    unsigned int _data_head;
    //实际使用内存长度
    unsigned int _data_len;
};

//连接对象cache
class ConnCache
{
public:
    ConnCache(CMemPool& mp) : _flow(0), _fd(0), _access(0), _type(0), _r(mp), _w(mp){}
    ~ConnCache(){}

    //连接唯一标示	
    unsigned _flow;
    //相关fd
    int _fd;
    //时间戳
    time_t _access;
    //连接类型: TCP_SOCKET\UDP_SOCKET\UNIX_SOCKET
    int _type;
    //对端信息: 
    CSocketAddr _addr;
    //读请求cache
    CRawCache _r;
    //写回复cache
    CRawCache _w;
};
		


