/******************************************************************************
  文 件 名   : TCP_Server_Base.h
  版 本 号   : v 0.0.1
  作    者   : BarretXia
  生成日期   : 2015年8月28日
  最近修改   :
  功能描述   : 服务基类, 子类需要实现CreateHandler .
  函数列表   :
  修改历史   :
  1.日    期   : 2015年8月28日
    作    者   : BarretXia
    修改内容   : 创建文件
******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#pragma once
#include <string.h>
#include "poller.h"
#include "net.h"
#include "TCP_Handler_Base.h"

class CTCP_Server_Base : public CPollerObject 
{
	public:
		CTCP_Server_Base(HandlerProxyBasic * handler_proxy){_handler_proxy = handler_proxy;};
		virtual ~CTCP_Server_Base( ){};
		virtual int Init()=0;
	protected:
/*****************************************************************************
 函 数 名  : TCP_Server_Base.CreateHandler
 功能描述  : 创建新链接的句柄
 输入参数  : int netfd                 
             struct sockaddr_in * peer  
 输出参数  : 无
 返 回 值  : TCP_Handler_Base *
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2015年8月28日
    作    者   : BarretXia
    修改内容   : 新生成函数
*****************************************************************************/
		virtual CTCP_Handler_Base * CreateHandler(int netfd, struct sockaddr* peer) = 0;
	public:
		virtual void ProcessInnerMessage() = 0;
	public:
		HandlerProxyBasic * _handler_proxy;
};


