/******************************************************************************
  文 件 名   : clib_time.h
  版 本 号   : 初稿
  作    者   : BarretXia
  生成日期   : 2015年11月27日
  最近修改   :
  功能描述   : 时间处理
  函数列表   :
  修改历史   :
  1.日    期   : 2015年11月27日
    作    者   : BarretXia
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#pragma once
#include <time.h>
#include <stdlib.h>
 /*----------------------------------------------*
  * 外部变量说明                                 *
  *----------------------------------------------*/

  /*----------------------------------------------*
   * 外部函数原型说明                             *
   *----------------------------------------------*/

   /*----------------------------------------------*
    * 内部函数原型说明                             *
    *----------------------------------------------*/

    /*----------------------------------------------*
     * 全局变量                                     *
     *----------------------------------------------*/

     /*----------------------------------------------*
      * 模块级变量                                   *
      *----------------------------------------------*/

      /*----------------------------------------------*
       * 常量定义                                     *
       *----------------------------------------------*/

       /*----------------------------------------------*
        * 宏定义                                       *
        *----------------------------------------------*/

class CTimeHelper
{
public:
    static time_t GetCurrentDayStartStamp();
    static time_t GetStampOnClock(int clock, time_t stamp);
    static void SetClockForTm(struct tm * tm_in, struct tm * tm_out, int clock);
    static int GetDiffDay(time_t stamp_left, time_t stamp_right);
    static time_t GetDayStartStampByStamp(int stamp);
    static bool IsInSameWeekBeginOfMon(time_t dest_timestamp, int current_timestamp);
};
